#2 try
cask "ollama"
brew "lazydocker"
cask 'orbstack'
cask 'jordanbaird-ice'
# brew 'magic-wormhole'
cask 'feishu'

##1 react native
brew 'fastlane'

brew "doctl"

# brew "mas" # mac app store cli, compatible with brew bundle, can see by `brew bundle dump`
tap "buo/cask-upgrade"

##1.3 shell/terminal
brew "zellij"
brew "neovim"
brew "starship"
brew "atuin"
# brew "autojump"
brew "zoxide"
brew "fzf"
brew "trash"

brew "jq"

brew "shfmt"

brew "tldr"
brew "tree"

brew 'btop'

### linux
brew "coreutils"

##1.5 window manager
cask "karabiner-elements"
# brew "tmux"

##2 git
brew "git"
brew "lazygit"
cask "github"
brew "gh"
brew "gist"
# brew "act"
brew "chezmoi"
brew "bfg"
# brew "git-lfs"

## mac
# cask "alt-tab"
tap "fwartner/tap"
brew "fwartner/tap/mac-cleanup"
cask "easydevo"
cask "anki"

##1.5 font
cask "font-input"
cask "font-fira-code-nerd-font"

##2 develop
cask "visual-studio-code"
cask "alacritty"
# cask "kitty"
cask "postman"
cask "openinterminal"

##1 app
cask "raycast"
cask "arc"
cask "google-chrome"
cask "google-chrome@dev"
cask "firefox"
cask "firefox@developer-edition"
# cask "microsoft-edge"

cask 'mos'

cask "bob"
cask "espanso"
cask "menubarx"
# cask "itsycal"
cask "monitorcontrol"
cask "input-source-pro"
cask "1password"
# cask "1password-cli"

# cask 'notunes'

##1.2 media
brew 'imagemagick' # convert
brew "ffmpeg"
cask "snipaste"
# cask "flameshot"
cask "shottr"
brew "yt-dlp"
cask "kap"

##0.3 office
cask "typora"
# cask "obsidian"
brew "pandoc"

## Xcodes
brew "aria2" # for quicker xcodes download
brew "robotsandpencils/made/xcodes"
# brew "watchman"
# run "xcodes install --latest --experimental-unxip"

##0.1 fun?
# brew "asciinema"

## 0.5 Else
# cask "spotify"

# cask "electron-fiddle"

# tap "gleich/homebrew-taps"
# brew "nuke"

# cask "dropbox"
# cask "locationsimulator"

# tap "koekeishiya/formulae"
# brew "yabai"
# brew "skhd"

# mas "Gifski", id: 1351639930
# mas "iMovie", id: 408981434
# cask "losslesscut"
# cask "diffusionbee"

##1.1 Safari
# mas "1Password for Safari", id: 1569813296
# mas "Stay", id: 1591620171
# mas "Tampermonkey", id: 1482490089
# mas "Vimari", id: 1480933944

##1 communication
# cask "wechat"
# cask "qq"

##1 python
# brew "pyenv"

##1 rust
# brew "rustup-init"

##1 ruby
# brew "rbenv"

##0.8 container&db
# brew "ansible"
# cask "docker"

# cask 'openvpn-connect'
# cask 'alacritty'
# cask 'obs'
# cask 'devcleaner'
# cask 'netnewswire'
# cask 'jan'
# cask 'ticktick'
# cask 'bleunlock'

# cask "wireshark"
# brew "swift-format"

