# brew tap "homebrew/bundle"
#2 try
cask "locationsimulator"
tap "artginzburg/tap"
brew "sudo-touchid"
# sudo brew services start sudo-touchid

tap "homebrew/autoupdate"
tap "buo/cask-upgrade"

tap "simonw/llm"
brew "llm"

##1.3 terminal
brew "starship"
brew "trash"
brew "tree"
brew "jq"
brew "shfmt"
brew "shellcheck"
brew "autojump"
brew "tldr"

##1.5 window manager
tap "koekeishiya/formulae"
brew "yabai"
brew "skhd"
cask "karabiner-elements"
brew "tmux"

##2 git
brew "git"
cask "github"
brew "gh"
brew "chezmoi"
brew "bfg"
# brew "git-lfs"
# tap "zurawiki/brews"
# brew "zurawiki/brews/gptcommit"

##0.5 mac
tap "fwartner/tap"
brew "fwartner/tap/mac-cleanup"

##1 java
brew "java"
brew "sbt"
##1 node
brew "nvm"
##1 python
brew "pyenv"
##1 rust
brew "rustup-init"
##1 ruby
brew "rbenv"

##1.5 font
tap "homebrew/cask-fonts"
cask "font-input"

##2 develop
cask "visual-studio-code"
brew "neovim"
cask "iterm2"
cask "postman"
cask "openinterminal"

##0.8 container&db
# cask "docker"
# brew "cog"
# tap "mongodb/brew"
# brew "mongodb-community"
# brew "terraform"
# brew "kafka"

##1 mac
cask "raycast"
cask "arc"
cask "bob"
cask "hiddenbar"
cask "menubarx"
cask "monitorcontrol"
cask "input-source-pro"
cask "1password"
# cask "notion"
# cask "1password-cli"

##1 communication
cask "wechat"
cask "qq"

##1.2 media
cask "snipaste"
cask "shottr"
cask "kap"
# cask "losslesscut"
# cask "diffusionbee"

##0.3 office
# cask "wpsoffice"
# cask "mactex"
# cask "mark-text"
cask "zotero"
brew "pandoc"
cask "imageoptim" # image compress

## Xcodes
brew "aria2" # for quicker xcodes download
brew "robotsandpencils/made/xcodes"
# brew "watchman"
# run "xcodes install --latest --experimental-unxip"

##0.1 fun?
# brew "asciinema"

## 0.5 Else
# cask "spotify"

# cask "podman-desktop"
# cask "electron-fiddle"
# cask "microsoft-outlook"
# cask "termius"

tap "homebrew/cask-versions"
cask "visual-studio-code-insiders"
# cask "rar"

##1 use mas install the app that already purchased
brew "mas" # mac app store cli, compatible with brew bundle, can see by `brew bundle dump`
mas "iMovie", id: 408981434
mas "1Password for Safari", id: 1569813296
mas "Stay - Safari Companion", id: 1591620171
mas "Vimari", id: 1480933944

##0.1 strange
