# brew tap "homebrew/bundle"
#2 try
# cask "simple-comic"

cask "espanso"
brew "sbcl"
tap "gleich/homebrew-taps"
brew "nuke"
brew "ast-grep"
cask "dropbox"
# brew "openfortivpn"
# cask "amethyst"
cask "alt-tab"
cask "locationsimulator"

brew "mas" # mac app store cli, compatible with brew bundle, can see by `brew bundle dump`
tap "homebrew/autoupdate"
tap "buo/cask-upgrade"

# tap "simonw/llm"
# brew "llm"

##10 human as llm
cask "anki"
cask "obsidian"
cask "notion" # for old staff only

##1.3 terminal
brew "atuin"
brew "autojump"
brew "trash"

brew "ripgrep"
brew "jq"

brew "shellcheck"
brew "shfmt"
tap "caarlos0/tap"
brew "jsonfmt"

brew "tldr"

brew "tree"
tap "samwho/spacer"
brew "spacer"


tap "artginzburg/tap"
brew "sudo-touchid"
# sudo brew services start sudo-touchid
### linux
brew "coreutils"

##1.5 window manager
tap "koekeishiya/formulae"
brew "yabai"
brew "skhd"
cask "karabiner-elements"
brew "tmux"

##2 git
brew "git"
cask "github"
brew "gh"
# brew "act"
brew "chezmoi"
brew "bfg"
# brew "git-lfs"
# tap "zurawiki/brews"
# brew "zurawiki/brews/gptcommit"

##0.5 mac
tap "fwartner/tap"
brew "fwartner/tap/mac-cleanup"

##1 java
brew "java"
brew "sbt"
##1 node
brew "n"
# brew "nvm"
##1 python
brew "pyenv"
##1 rust
brew "rustup-init"
##1 ruby
brew "rbenv"

##1.5 font
tap "homebrew/cask-fonts"
cask "font-input"

##2 develop
cask "visual-studio-code"
brew "neovim"
cask "iterm2"
cask "postman"
cask "openinterminal"

##0.8 container&db
cask "docker"
# brew "cog"
# tap "mongodb/brew"
# brew "mongodb-community"
# brew "terraform"
# brew "kafka"

##1 macos
cask "raycast"
cask "arc"
cask "google-chrome"
cask "microsoft-edge"
cask "firefox"
cask "bob"
# tap "pot-app/homebrew-tap"
# cask "pot"
cask "hiddenbar"
cask "menubarx"
cask "monitorcontrol"
cask "input-source-pro"
cask "1password"
cask "1password-cli"

##1.1 Safari
mas "1Password for Safari", id: 1569813296
mas "Stay", id: 1591620171
mas "Tampermonkey", id: 1482490089
mas "Vimari", id: 1480933944

##1 communication
cask "wechat"
cask "qq"

##1.2 media
brew "ffmpeg"
cask "snipaste"
cask "shottr"
brew "yt-dlp"
cask "kap"
# brew "gifski"
mas "Gifski", id: 1351639930
# mas "iMovie", id: 408981434
# cask "losslesscut"
# cask "diffusionbee"

##0.3 office
# cask "wpsoffice"
# cask "mactex"
# cask "mark-text"
cask "typora"
cask "zotero"
brew "pandoc"

## Xcodes
brew "aria2" # for quicker xcodes download
brew "robotsandpencils/made/xcodes"
# brew "watchman"
# run "xcodes install --latest --experimental-unxip"

##0.1 fun?
# brew "asciinema"

## 0.5 Else
# cask "spotify"

# cask "podman-desktop"
# cask "electron-fiddle"
# cask "microsoft-outlook"
# cask "termius"

tap "homebrew/cask-versions"
cask "visual-studio-code-insiders"
# cask "rar"

##0.1 strange
